todo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-17 Tue 14:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>todo</title>
<meta name="generator" content="Org-mode" />
<link rel="stylesheet" href="css/org-page.css"/>
</head>
<body>
<div id="content">
<h1 class="title">todo</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8e95617">category-category</a></li>
<li><a href="#orgeec5f29">universal-construction</a></li>
<li><a href="#orgc21e684">prove iso for universal-construction</a></li>
<li><a href="#orgfe55c30">set</a>
<ul>
<li><a href="#orga25c928">representable-functor and set</a></li>
<li><a href="#org726d4bd">fix set-morphism-t &#x2013; with set-t</a></li>
<li><a href="#org9890523">set-category</a></li>
</ul>
</li>
<li><a href="#orgc881c4b">arrow-eqv-t &#x2013; amend `arrow-eqv-relation` for all category</a></li>
<li><a href="#org73910f6">bifunctor</a></li>
<li><a href="#orgb981f16">nat-total-order</a></li>
<li><a href="#orga5dcc3f">monad as category</a></li>
<li><a href="#orgfa83eff">dependent-category &#x2013; use pullback, pushout and equalizer</a></li>
<li><a href="#org296796c">topos-theory</a></li>
<li><a href="#orgb7e85b7">logic programming interface of the type system</a></li>
<li><a href="#org3a20d77">use number theory to test type-checker as prover</a></li>
<li><a href="#org159777d">algebraic structure</a></li>
<li><a href="#org1b5f764">should (:) (&lt;:) form types too ? &#x2013; like eqv-c</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8e95617" class="outline-2">
<h2 id="org8e95617">category-category</h2>
</div>

<div id="outline-container-orgeec5f29" class="outline-2">
<h2 id="orgeec5f29">universal-construction</h2>
<div class="outline-text-2" id="text-orgeec5f29">
<ul class="org-ul">
<li><p>a carefully designed modelling of universal-construction</p><p>is the core of modelling category-theory</p></li></ul>
</div>
</div>

<div id="outline-container-orgc21e684" class="outline-2">
<h2 id="orgc21e684">prove iso for universal-construction</h2>
<div class="outline-text-2" id="text-orgc21e684">
<ul class="org-ul">
<li><p>a universal-construction is unique up to unique isomorphism</p></li>

<li><p>we need to use unique to prove eqv</p></li></ul>
</div>
</div>

<div id="outline-container-orgfe55c30" class="outline-2">
<h2 id="orgfe55c30">set</h2>
<div class="outline-text-2" id="text-orgfe55c30">
</div><div id="outline-container-orga25c928" class="outline-3">
<h3 id="orga25c928">representable-functor and set</h3>
</div>

<div id="outline-container-org726d4bd" class="outline-3">
<h3 id="org726d4bd">fix set-morphism-t &#x2013; with set-t</h3>
<div class="outline-text-3" id="text-org726d4bd">
<ul class="org-ul">
<li><p>maybe no top level eqv-s</p></li>

<li><p>x -</p><p>maybe we can not afford to do this.</p><p>for syntax reason.</p></li></ul>
</div>
</div>

<div id="outline-container-org9890523" class="outline-3">
<h3 id="org9890523">set-category</h3>
<div class="outline-text-3" id="text-org9890523">
<ul class="org-ul">
<li><p>surjective</p></li>

<li><p>injective</p></li>

<li><p>bijective</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-orgc881c4b" class="outline-2">
<h2 id="orgc881c4b">arrow-eqv-t &#x2013; amend `arrow-eqv-relation` for all category</h2>
<div class="outline-text-2" id="text-orgc881c4b">
<ul class="org-ul">
<li><p>arrow-eqv-t must be an eqv-relation-t</p><p>for all hom-set [a b arrow-t]</p></li></ul>
</div>
</div>

<div id="outline-container-org73910f6" class="outline-2">
<h2 id="org73910f6">bifunctor</h2>
<div class="outline-text-2" id="text-org73910f6">
<ul class="org-ul">
<li><p>checking functorial laws of pair of categories,</p><p>[where pair is Cartesian product]</p><p>is equivalent to</p><p>checking functorial laws for each component of the pair.</p><p></p><p><ul class="org-ul"></p><p><li><p>this is the whole point of Cartesian product</p></li></ul></p></li></ul>
</div>
</div>

<div id="outline-container-orgb981f16" class="outline-2">
<h2 id="orgb981f16">nat-total-order</h2>
</div>

<div id="outline-container-orga5dcc3f" class="outline-2">
<h2 id="orga5dcc3f">monad as category</h2>
</div>

<div id="outline-container-orgfa83eff" class="outline-2">
<h2 id="orgfa83eff">dependent-category &#x2013; use pullback, pushout and equalizer</h2>
<div class="outline-text-2" id="text-orgfa83eff">
<ul class="org-ul">
<li><p>maybe we still need to get out of category at the end</p></li>

<li><p>to open a new mode of explanation</p></li></ul>
</div>
</div>

<div id="outline-container-org296796c" class="outline-2">
<h2 id="org296796c">topos-theory</h2>
</div>

<div id="outline-container-orgb7e85b7" class="outline-2">
<h2 id="orgb7e85b7">logic programming interface of the type system</h2>
</div>

<div id="outline-container-org3a20d77" class="outline-2">
<h2 id="org3a20d77">use number theory to test type-checker as prover</h2>
</div>

<div id="outline-container-org159777d" class="outline-2">
<h2 id="org159777d">algebraic structure</h2>
<div class="outline-text-2" id="text-org159777d">
<ul class="org-ul">
<li><p>(*) and (+) in type-t</p><p>provide two commutative monoidal structures &#x2013; semi-ring-t</p><p>for we can’t define subtraction of types.</p><p>&#x2013; a.k.a rig-t, ring without negative.</p><p></p><p><ul class="org-ul"></p><p><li><p><p></p><p>note that, to be monoidal-category,</p><p>the binary operator must also be a bifunctor.</p><p></p></p><p></p><p><p></p><p>i.e. the monoidal product must be</p><p>compatible with the structure of the category,</p><p>which is defined by morphisms.</p><p></p></p></li></ul></p></li>

<li><p><p></p><p>order relation for algebraic data type</p><p></p></p><p></p><p><p></p><p>for example :</p><p>a &lt; a + b</p><p>a &lt; a * 2</p><p></p></p><p></p><p><p></p><p>this can be viewed as a functor from type-t to rational-s</p><p></p></p></li>

<li><p>x -</p><p>can we extend the algebraic structure to dependent type ?</p></li>

<li><p>k -</p><p>we will need to extend the algebraic structure to object</p></li>

<li><p>x -</p><p>object are just like type.</p><p>just without sum-type, only product-type.</p></li></ul>
</div>
</div>

<div id="outline-container-org1b5f764" class="outline-2">
<h2 id="org1b5f764">should (:) (&lt;:) form types too ? &#x2013; like eqv-c</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-07-17 Tue 14:15</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
